; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	infrared2 - mode
	infrared3 - mode
	infrared4 - mode
	thermograph0 - mode
	infrared1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	Star9 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation4 - direction
	Star8 - direction
	Star2 - direction
	Star5 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 infrared4)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star8)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
	(supports instrument3 infrared3)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star5)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon11)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite1 Phenomenon10)
	(have_image Phenomenon10 thermograph0)
	(have_image Phenomenon11 infrared4)
	(have_image Phenomenon12 infrared3)
	(have_image Planet13 infrared2)
	(have_image Star14 infrared2)
))

)

; plan
1. (turn_to satellite1 groundstation4 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 7
2. (turn_to satellite0 star8 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star8)
   goals met: 0 of 7
3. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 7
4. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 7
5. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
6. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 0 of 7
7. (calibrate satellite0 instrument1 star8)
   added: (calibrated instrument1)
   goals met: 0 of 7
8. (turn_to satellite0 phenomenon11 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon11)
   goals met: 0 of 7
9. (take_image satellite0 phenomenon11 instrument1 infrared4)
   added: (have_image phenomenon11 infrared4)
   goals met: 1 of 7
10. (turn_to satellite0 groundstation4 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation4)
   goals met: 2 of 7
11. (turn_to satellite1 phenomenon12 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 7
12. (take_image satellite1 phenomenon12 instrument3 infrared3)
   added: (have_image phenomenon12 infrared3)
   goals met: 3 of 7
13. (turn_to satellite1 phenomenon10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 7
14. (turn_to satellite2 star5 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star5)
   goals met: 4 of 7
15. (calibrate satellite2 instrument4 star5)
   added: (calibrated instrument4)
   goals met: 4 of 7
16. (turn_to satellite2 phenomenon10 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 phenomenon10)
   goals met: 4 of 7
17. (take_image satellite2 phenomenon10 instrument4 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 5 of 7
18. (turn_to satellite2 planet13 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet13)
   goals met: 5 of 7
19. (take_image satellite2 planet13 instrument4 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 6 of 7
20. (turn_to satellite2 star14 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 star14)
   goals met: 6 of 7
21. (take_image satellite2 star14 instrument4 infrared2)
   added: (have_image star14 infrared2)
   goals met: 7 of 7
